Repository: JoeSlain/Nexpo
Catalog: packages/app/locales/*/messages.po
Languages: cs, fr

source: A production-ready monorepo template for building cross-platform applications with Next.js and React Native (Expo)
cs: Šablona monorepa připravená k výrobě pro vývoj multiplatformních aplikací s Next.js a React Native (Expo)
fr: Un modèle de monorepo prêt pour la production pour créer des applications multiplateformes avec Next.js et React Native (Expo)

source: Check the README.md for setup instructions and documentation
cs: Zkontrolujte README.md pro pokyny k nastavení a dokumentaci.
fr: Consultez le README.md pour les instructions d'installation et la documentation.

source: Click to test the protected tRPC procedure. This will work whether you're authenticated or not, but will show different results.
cs: Klikněte pro testování chráněné tRPC procedury. To bude fungovat, ať už jste autentizováni, nebo ne, ale zobrazí různé výsledky.
fr: Cliquez pour tester la procédure tRPC protégée. Cela fonctionnera que vous soyez authentifié ou non, mais affichera des résultats différents.

source: Cross-platform monorepo template
cs: Šablona monorepa pro více platforem
fr: Modèle de monorepo multiplateforme

source: Current Locale
cs: Aktuální lokalita
fr: Locale actuel

source: Current Status: {0}
cs: Aktuální stav: {0}
fr: Statut actuel : {0}

source: Demo Features
cs: Demo funkce
fr: Fonctionnalités de démonstration

source: Example Translated Text
cs: Příklad přeloženého textu
fr: Texte traduit exemple

source: Internationalization (i18n)
cs: Mezinárodní lokalizace (i18n)
fr: Internationalisation (i18n)

source: Internationalization (i18n) Demo
cs: Demonstrace internacionalizace (i18n)
fr: Démonstration d'internationalisation (i18n)

source: Language
cs: Jazyk
fr: Langue

source: Language Code
cs: Kód jazyka
fr: Code de langue

source: Language Tag
cs: Jazyková značka
fr: Étiquette de langue

source: Password
cs: Heslo
fr: Mot de passe

source: Sign Out
cs: Odhlásit se
fr: Déconnexion

source: Signed In
cs: Přihlášeno
fr: Connecté

source: Supabase Auth Test
cs: Testování autentizace Supabase
fr: Test Auth Supabase

source: Switch Language
cs: Změnit jazyk
fr: Changer de langue

source: Test Protected tRPC Procedure
cs: Testovaný chráněný tRPC postup
fr: Tester la procédure tRPC protégée.

source: Test the useLocale hook to switch languages and see how translations work in real-time
cs: Otestujte použití hooku useLocale pro přepínání jazyků a zjistěte, jak překlady fungují v reálném čase.
fr: Testez le hook useLocale pour changer de langue et voir comment les traductions fonctionnent en temps réel.

source: Text Direction
cs: Směr textu
fr: Direction du texte

source: This text changes based on the selected locale. The useLocale hook provides access to locale information and works seamlessly with Lingui for translations.
cs: Tento text se mění podle vybraného jazyka. Hook useLocale poskytuje přístup k informacím o jazyce a bezproblémově funguje s Lingui pro překlady.
fr: Ce texte change en fonction de la locale sélectionnée. Le hook useLocale fournit l'accès aux informations de locale et fonctionne parfaitement avec Lingui pour les traductions.

source: Try out authentication and protected API endpoints to see the template in action
cs: Vyzkoušejte autentizaci a chráněné API koncové body, abyste viděli šablonu v akci.
fr: Essayez l'authentification et les points de terminaison API protégés pour voir le modèle en action.

source: Usage Example
cs: Příklad použití
fr: Exemple d'utilisation

source: Use the useLocale hook to access locale information and switch languages dynamically
cs: Použijte hook useLocale k přístupu k informacím o lokalizaci a dynamické změně jazyků.
fr: Utilisez le hook useLocale pour accéder aux informations de locale et changer de langue dynamiquement.

source: User ID: {0}...
cs: Uživatelské ID: {0}...
fr: ID utilisateur : {0}...

source: What's Included
cs: Co je zahrnuto
fr: Ce qui est inclus
